{
  "main": {
    "name":"Marco Guida",
    "occupation":"Software Developer",
    "description":"I’m a software developer with an entrepreneurial flair and am experienced in working across the full tech stack, especially for mobile. I’m objective-driven - I code because I love seeing my products used in the hands of people around the world.",
    "image":"profilepic.jpg",
    "bio":"I’m a junior software developer with experience working across the full stack of multiple software products, primarily mobile. On front-end, I’ve used React.js and Angular to develop web apps and have worked even more so with React Native to build elegant mobile apps, some my own and others for companies I’ve worked with. I’m actively exploring pure native development for iOS and Android. Meanwhile on back-end, I’ve commonly used AWS (which includes API Gateway, Lambda, S3, Cognito, Elemental MediaConvert) + MongoDB for user authentication, my own RESTful APIs, and data and asset storage. I’ve also worked with a mix of other technologies, like MySQL, Java, and Firebase, for other back-ends. I enjoy working in an assortment of other fields as well, from supervised learning and neural networks for machine learning projects, to UI/UX design of logos, glyphs, and marketing material using Sketch app. Interested in connecting or collaborating? Let's get in touch!",
    "email": "marcoguida724@gmail.com",
    "phone": "514-895-7506",
    "address":{
      "city":"Montreal"
    },
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/marcoguida/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/iwantadventureinthegreatwidesomewhere",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"McGill University",
        "degree":"B.S. Computer Science",
        "graduated":"2017 - Present",
        "description":null
      }
    ],
    "work":[
      {
        "company":"Agility PR Solutions",
        "title":"Angular Front-End Developer Intern",
        "years":"May 2020 - August 2020",
        "description":"I started my internship working on the development of web applications using Angular for Agility’s media outreach, monitoring, and measurement tools. The scope of my initial work involved the UI components for Agility’s targeting and monitoring platform, which included media briefings, search features, and graphical analysis tools (e.g. maps, charts). Further, I participated in an agile work environment through Atlassian's Jira project management tool.\nWithin a month, my responsibilities expanded to development across the full tech stack, which allowed me to contribute to robust RESTful API services made with Java as well as the architecture of a MySQL database. This provided me the opportunity to take full control of the implementation of brand new platform features, as I developed both their back-end and front-end pieces from start to finish. Additionally, I developed tools to improve the workflow of the back-end teams, which included Jenkins scripts for automated back-end deployment that reduced deployment times of new codebase changes from 30 minutes down to 5 minutes."
      },
      {
        "company":"Joyleaf",
        "title":"Founder",
        "years":"February 2019 - September 2019",
        "description":"The cannabis industry is one of few that has severely lagged in tech, in large part due to legal complications. With more and more countries legalizing marijuana, consumers want a simple and intuitive experience to finding cannabis perfect for them, both for recreational and medical purposes. Joyleaf is that experience.\nJoyleaf is a strain finder app on iOS and Android that lets you discover over 2,000 unique marijuana strains from around the world so you can find cannabis perfect for you.\nI led a team of three other developers, who primarily worked on front-end development and algorithm design for our REST API.\nI used Xamarin Forms, a .NET cross-platform UI framework, to deliver a smooth, native, front-end experience for both iOS and Android, with a C#-shared codebase to boost development workflow.\nI developed the back-end with Firebase in order to authenticate users, store app data, and host a REST API.\nI also used Sketch and Photoshop to design all the visual components, including the app icon, splash screens, promotional media, and all the glyphs in the app."
      },
      {
        "company":"MG2 Media",
        "title":"React Native Front-End Developer Intern",
        "years":"July 2019 - August 2019",
        "description":"I led the development of the PMI Chapter Event Scanner mobile app available on the App Store and Google Play Store for Project Management Institute (PMI), a global client of MG2 Media. The app enables PMI event hosts to seamlessly check-in guests with a QR code scanner and spans 40 PMI locations across North America, from Montreal to Hawaii.\nI used React Native, an open-source mobile application framework, to develop the front-end for both iOS and Android. I also worked with Redux to properly manage application state, and communicated with back-end teams to facilitate communications with the server via a REST API."
      }
    ],
    "skills":[
      {
        "name":"React Native",
        "level":"85%"
      },
      {
        "name":"Node.js",
        "level":"85%"
      },
      {
        "name":"JavaScript",
        "level":"75%"
      },
      {
        "name":"Java",
        "level":"85%"
      },
      {
        "name":"AWS",
        "level":"60%"
      },
      {
        "name":"MongoDB",
        "level":"50%"
      },
      {
        "name":"UI/UX",
        "level":"85%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Multi-Label Classification of Image Data",
        "category":"Neural network for modified MNIST",
        "image":"ml.jpg",
        "url":"https://github.com/iwantadventureinthegreatwidesomewhere/Multi-Label-Classification-of-Image-Data"
      },
      {
        "title":"Multi-Class Logistic Regression and Gradient Descent",
        "category":"Multi-class logistic regression model",
        "image":"ml.jpg",
        "url":"https://github.com/iwantadventureinthegreatwidesomewhere/Multi-Class-Logistic-Regression-and-Gradient-Descent"
      },
      {
        "title":"Analyzing COVID-19 Search Trends and Hospitalization",
        "category":"Supervised learning for analyzing COVID-19",
        "image":"ml.jpg",
        "url":"https://github.com/iwantadventureinthegreatwidesomewhere/Analyzing-COVID-19-Search-Trends-and-Hospitalization"
      },
      {
        "title":"Joyleaf",
        "category":"Cannabis strain finder mobile app for iOS and Android",
        "image":"joyleaf.jpg",
        "url":"https://github.com/iwantadventureinthegreatwidesomewhere/Joyleaf"
      },
      {
        "title":"PMI Chapter Event Scanner",
        "category":"PMI event check-in mobile app for iOS and Android",
        "image":"pmi.jpg",
        "url":"https://github.com/iwantadventureinthegreatwidesomewhere/PMI-Chapter-Event-Scanner"
      },
      {
        "title":"Pentago-Swap Game Playing AI",
        "category":"Pentago-Swap game playing AI",
        "image":"pentago.jpg",
        "url":"https://github.com/iwantadventureinthegreatwidesomewhere/Pentago-Swap-AI#pentago-swap-game-playing-ai"
      }
    ]
  }
}
